Table of Contents
 Class ReinfBarByTwoPoints
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Representing reinforcement bar input by two points in IDEA StatiCa Detail
[OpenModelClass(typeof(Reinforcement))]
public class ReinfBarByTwoPoints : ReinforcementGroup
Inheritance
object
OpenObject
OpenElementId
Reinforcement
ReinforcementGroup
ReinfBarByTwoPoints
Inherited Members
 ReinforcementGroup.Diameter
 ReinforcementGroup.NumOfBarsInLayer
 ReinforcementGroup.CoverFromSetting
 ReinforcementGroup.Cover
 ReinforcementGroup.EndsTypeBeg
 ReinforcementGroup.EndsTypeEnd
 ReinforcementGroup.DiameterOfMandrel
 Reinforcement.ReinfId
 Reinforcement.Material
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ReinfBarByTwoPoints()
Constructor
public ReinfBarByTwoPoints()
Properties
 BarDistance
Vector determining direction of reinforcement layers, vector is defined in local coordinates of first segment
public Vector3D BarDistance { get; set; }
Property Value
Vector3D
 Distance
Distance between reinforcement layers
public double Distance { get; set; }
Property Value
double
 MasterComponent1
First master component of reinforcement
public ReferenceElement MasterComponent1 { get; set; }
Property Value
ReferenceElement
 MasterComponent2
Second master component of reinforcement
public ReferenceElement MasterComponent2 { get; set; }
Property Value
ReferenceElement
 MasterPoint1
First master point of reinforcement
public int MasterPoint1 { get; set; }
Property Value
int
 MasterPoint2
Second master point of reinforcement
public int MasterPoint2 { get; set; }
Property Value
int
 NumOfLayers
Number of layers
public int NumOfLayers { get; set; }
Property Value
int
 Position1
Offset between first master point and first point of bar
public Vector3D Position1 { get; set; }
Property Value
Vector3D
 Position2
Offset between second master point and second point of bar
public Vector3D Position2 { get; set; }
Property Value
Vector3D
 Edit this page